DeviceProcessEvents
| where FileName in~ ("cmd.exe", "powershell.exe", "powershell_ise.exe")
| where ProcessCommandLine has_any (
    "net accounts",
    "net accounts /domain",
    "whoami /all",
    "nltest /domain_trusts",
    "net user",
    "net user /domain",
    "net localgroup",
    "net localgroup administrators",
    "wmic useraccount",
    "setspn -T",
    "setspn -Q",
    "setspn -L",
    "klist"
    "Get-ADDefaultDomainPasswordPolicy",
    "Get-DomainPolicy",
    "Get-DomainPolicyData",
    "SystemAccess",
    "(Get-DomainPolicy).SystemAccess",
    "MinimumPasswordLength",
    "PasswordHistoryCount",
    "Get-LocalUser",
    "Get-LocalGroup",
    "Get-ADUser",
    "Get-ADComputer",
    "Get-ADGroup",
    "Get-ADServiceAccount",
    "Get-DomainUser -SPN",
    "Get-DomainSPNTicket",
    "Invoke-Mimikatz" ,
    "Invoke-ShareFinder",
    "PowerView",
    "NetGPO",
    "DSInternals"
    )
| extend CommandLineEvidence = extract(@"^(.*?)(net accounts|Get-ADDefaultDomainPasswordPolicy|SystemAccess|MinimumPasswordLength).*", 0, ProcessCommandLine)
| project
    TimeGenerated,
    DeviceName,
    InitiatingProcessAccountName,
    FileName,
    ProcessCommandLine,
    CommandLineEvidence,
    InitiatingProcessParentFileName